### Dataframes
* Multi-column data
* each column represents a different variable
* every column contains data of its own type
* we can preserve data consistency

In [1]:
import pandas as pd
import numpy as np

#### 1. Construct a dataframe from dictionary of lists

In [3]:
data = {'Product Name':['Product A','Product B','Product C'],'Product Price':[22250,16600,12500]}
data

{'Product Name': ['Product A', 'Product B', 'Product C'],
 'Product Price': [22250, 16600, 12500]}

In [4]:
# Dictionary keys will work like column name and values will work like rows
df = pd.DataFrame(data)
df

  Product Name  Product Price
0    Product A          22250
1    Product B          16600
2    Product C          12500

#### 2. Construct a dataframe from dictionary of lists + specify the index

In [5]:
data = {'Product Name':['Product A','Product B','Product C'],'Product Price':[22250,16600,12500]}
product_ids = ['A','B','C']
df = pd.DataFrame(data,index=product_ids)
df

  Product Name  Product Price
A    Product A          22250
B    Product B          16600
C    Product C          12500

#### 3. Construct a dataframe from a list of dictionaries

In [6]:
data = [
    {'Product Name':'Product A','Product Price':22250},
    {'Product Name':'Product B','Product Price':16600},
    {'Product Name':'Product C','Product Price':12500}
]
data

[{'Product Name': 'Product A', 'Product Price': 22250},
 {'Product Name': 'Product B', 'Product Price': 16600},
 {'Product Name': 'Product C', 'Product Price': 12500}]

In [8]:
df = pd.DataFrame(data)
df

  Product Name  Product Price
0    Product A          22250
1    Product B          16600
2    Product C          12500

In [9]:
data = [
    {'Product Name':'Product A','Product Price':22250},
    {'Product Name':'Product B','Product Price':16600},
    {'Product Name':'Product C','Product Price':[12500,10000]}
]
df = pd.DataFrame(data)
df

  Product Name   Product Price
0    Product A           22250
1    Product B           16600
2    Product C  [12500, 10000]

#### 4. Construct a dataframe from dictionary of pandas series

In [10]:
ser_products = pd.Series(['Product A','Product B','Product C'])
ser_prices = pd.Series([22250,16600,12500])

In [11]:
data = {'Product Name':ser_products,'Product Price':ser_prices}
df = pd.DataFrame(data)
df

  Product Name  Product Price
0    Product A          22250
1    Product B          16600
2    Product C          12500

In [12]:
ser_products = pd.Series(['Product A','Product B','Product C'],index=['A','B','C'])
ser_prices = pd.Series([22250,16600,12500],index=['A','B','C'])
data = {'Product Name':ser_products,'Product Price':ser_prices}
df = pd.DataFrame(data)
df

  Product Name  Product Price
A    Product A          22250
B    Product B          16600
C    Product C          12500

In [13]:
ser_products = pd.Series(['Product A','Product B','Product C'],index=['A','B','C'])
ser_prices = pd.Series([22250,16600,12500],index=['C','B','A'])
data = {'Product Name':ser_products,'Product Price':ser_prices}
df = pd.DataFrame(data)
df

  Product Name  Product Price
A    Product A          12500
B    Product B          16600
C    Product C          22250

#### 5. Construct a dataframe from list of lists

In [14]:
data = [['Product A',22250],['Product B',16600],['Product C',12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [15]:
data = [['Product A',22250],['Product B',16600],['Product C',12500,500]]
df = pd.DataFrame(data)
df

           0      1      2
0  Product A  22250    NaN
1  Product B  16600    NaN
2  Product C  12500  500.0

In [18]:
data = [['Product A',22250],['Product B',16600],['Product C',12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [22]:
df.columns = ["Product Name","Product Price"]
df

  Product Name  Product Price
0    Product A          22250
1    Product B          16600
2    Product C          12500

In [23]:
df.index = ["A","B","C"]
df

  Product Name  Product Price
A    Product A          22250
B    Product B          16600
C    Product C          12500

#### 6. Construct a dataframe in professional way

In [24]:
df = pd.DataFrame(data=[['Product A',22250],['Product B',16600],['Product C',12500]],
                 columns=["Product Name","Product Price"],
                 index=["A","B","C"])
df

  Product Name  Product Price
A    Product A          22250
B    Product B          16600
C    Product C          12500

In [25]:
df.shape

(3, 2)

In [26]:
type(df)

pandas.core.frame.DataFrame